// var> let

// let a  = 12
// console.log(a)
// const b = 25
// console.log(b)
// a = 25
// console.log(a)
// b = 40
// console.log(b)

// let a = 'privet mir'
// alert(a)
// a = prompt('title')
// alert(a)

// ТИПЫ ДАННЫХ?
// ПРЕОБРАЗОВАНИЕ ТИПОВ?
// ОПЕРАТОРЫ?
// УСЛОВНЫЕ ВЕТВЛЕНИЯ IF ELSE,
// ЦИКЛЫ
// Конструкциии
// Функциии
// Стрелочные Функциии
// ...

// let a = 25
// let b = 40
// // let c = a + b
// // alert(c)
// alert(a + b)


// ОПЕРАТОРЫ 

// = - присвоить
// == - равно
// === -  строгое равно ?
// +
// -
// *
// /
// % - остаток от деления 5 / 3 = 1,6 | 5 % 3 = 2
// ** - возведение в степень
// let a = 5
// let b = 3
// alert(a % b)
//  8 % 3

// a = a + 1
// a += 1
// a = b = c = d = f = 25 + 25
// alert(50)

// ОПЕРАТОРЫ СРАВНЕНИЯ

// a<b a>b
// a>=b a<=b
// a == b
// a != b

// ТИПЫ ДАННЫХ 

// n = 12 ЧИСЛО Number
// a = 'привет' строка String
// c = true / false булевый тип Boolean
// typeof - вывод информации о типе ДАННЫХ


// УСЛОВНОЕ  ВЕТВЛЕНИЕ IF 

// if (значение) {
//     результат для выполнения
// }

// let a = prompt('В каком году закончится 2023 год')
// if (a == 2023) {
//     alert('Красава')
// }else if (a < 2023) {
//     alert('не верно')
// }else if (a > 2023) {
//     alert('Чет ты загнул')
// }


// Задача №1 
// написать программу которая проверят сколько вам лет прежде чем пустить на сайт Если указали 18 то вывод сообщения проходите но вам 18, если больше - то просто проходите, если  меньше 18 то не проходите.

// let a = prompt('')
// if (a == 18) {
//     ..
// }else if (a > 18) {
//     ..
// }esle {
//     ..
// }



// #задача  2
// Написать программу которая будет проверять, является ли число четным или нет.
// Число мы вводим с клавиатуры

// let a = prompt()
// if (a % 2 ===0) {
//     alert('Четные')
// }else {
//     alert('не четные')
// }

// Задача 3
// Написать программу которая при сравнее двух числел если они оказываются равными, будет брать сумму этих чисел и прибавлять к ним 1000

// let a = Number(prompt())
// let b = Number(prompt())
// if (a  === b) {
//     let sum = (a + b) + 1000
//     alert(sum)
// }
